src/cf/DocumentJournals/ДокументыПоОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыПоОС</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПринятиеКУчетуОС</xr:Item>
				<xr:Item>Document.МодернизацияОС</xr:Item>
				<xr:Item>Document.ПеремещениеОС</xr:Item>
				<xr:Item>Document.ПодготовкаКПередачеОС</xr:Item>
				<xr:Item>Document.СписаниеОС</xr:Item>
				<xr:Item>Document.ПередачаОС</xr:Item>
				<xr:Item>Document.ИнвентаризацияОС</xr:Item>
				<xr:Item>Document.ПередачаОборудованияВМонтаж</xr:Item>
				<xr:Item>Document.ВыкупПредметовЛизинга</xr:Item>
				<xr:Item>Document.ПередачаОСВАренду</xr:Item>
				<xr:Item>Document.ВозвратОСОтАрендатора</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<References>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.ОбъектСтроительства</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.ОбъектСтроительства</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.ОбъектСтроительства</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СобытиеОС</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.СобытиеОС</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<References>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.СписаниеОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.РучнаяКорректировка</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/Documents/ИнвентаризацияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ИнвентаризацияОС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПроведенияИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеФактическое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПоРезультатамИнвентаризации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнвентаризационнаяКомиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Председатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DocumentJournals/ДокументыПоОС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Реестр документов ""Документы по ОС""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
	
КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;
	
	Если Метаданные.Документы.Найти("АвизоОСИсходящее") = Неопределено 
		ИЛИ Метаданные.Документы.Найти("АвизоОСВходящее") = Неопределено Тогда
		
		ПолеЗапросаИнфо =
		"	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ИнвентаризацияОС)
		|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.ИнвентаризацияОС).ПричинаПроведенияИнвентаризации
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПередачаОС)
		|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.ПередачаОС).Контрагент
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПринятиеКУчетуОС)
		|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.ПринятиеКУчетуОС).ВидОперации
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.МодернизацияОС) ИЛИ ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПередачаОборудованияВМонтаж)
		|			ТОГДА Таб.ОбъектСтроительства
		|		ИНАЧЕ Таб.СобытиеОС
		|	КОНЕЦ";
		
	Иначе
		
		ПолеЗапросаИнфо =
		"	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.АвизоОСИсходящее)
		|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.АвизоОСИсходящее).ОрганизацияПолучатель
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.АвизоОСВходящее)
		|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.АвизоОСВходящее).ОрганизацияОтправитель
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ИнвентаризацияОС)
		|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.ИнвентаризацияОС).ПричинаПроведенияИнвентаризации
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПередачаОС)
		|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.ПередачаОС).Контрагент
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПринятиеКУчетуОС)
		|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.ПринятиеКУчетуОС).ВидОперации
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.МодернизацияОС) ИЛИ ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПередачаОборудованияВМонтаж)
		|			ТОГДА Таб.ОбъектСтроительства
		|		ИНАЧЕ Таб.СобытиеОС
		|	КОНЕЦ";
		
	КонецЕсли;
	
	ПолеЗапросаСумма =
	"	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПередачаОС)
	|			ТОГДА Таб.Ссылка.СуммаДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ";
	
	Результат.Вставить("Информация",     ПолеЗапросаИнфо);
	Результат.Вставить("СуммаДокумента", ПолеЗапросаСумма);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
